
brew "readline"
brew "openssl"
brew "gdbm"
brew "pkg-config"

# lib for build
brew "pcre"
brew "boost"

# langeages
brew "python --with-brewed-openssl"
brew "ruby --with-doc"
brew "lua --with-completion"
brew "node"

# programming environmets
brew "ruby-build"
brew "rbenv"
brew "git"

# basic tools
brew "mercurial"
brew "--disable-etcdir zsh"
brew "zsh-completions"

# gnu tools and some
brew "coreutils"
brew "gawk"
brew "gnu-sed"
brew "wget"
brew "sl"
brew "tree"
brew "ctags"

# tools
brew "vim --override-system-vi --with-lua --with-ruby --with-python"
brew "macvim --with-luajit"
brew "source-highlight"
brew "reattach-to-user-namespace"
brew "tmux"
brew "lynx"
brew "tig"
